; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
;  - remove the road predicate to allow fully connected graph
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (not (at ?v ?l2))
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=5, packages=11, locations=13, density=1.0, fully_connected=True, max_capacity=2, out_folder=./fully/training, instance_id=24, seed=65

(define (problem transport-24)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity v5 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l8)
    (at p2 l9)
    (at p3 l8)
    (at p4 l9)
    (at p5 l6)
    (at p6 l11)
    (at p7 l7)
    (at p8 l4)
    (at p9 l2)
    (at p10 l9)
    (at p11 l8)
    (at v1 l5)
    (at v2 l4)
    (at v3 l11)
    (at v4 l8)
    (at v5 l10)
    )
 (:goal  (and 
    (at p1 l12)
    (at p2 l1)
    (at p3 l5)
    (at p4 l2)
    (at p5 l3)
    (at p6 l9)
    (at p7 l12)
    (at p8 l3)
    (at p9 l13)
    (at p10 l11)
    (at p11 l2))))

; plan
1. (drive v5 l10 l6)
   deleted: (at v5 l10)
   added: (at v5 l6)
   goals met: 0 of 11
2. (pick-up v5 l6 p5 c1 c2)
   deleted: (at p5 l6) (capacity v5 c2)
   added: (in p5 v5) (capacity v5 c1)
   goals met: 0 of 11
3. (drive v5 l6 l3)
   deleted: (at v5 l6)
   added: (at v5 l3)
   goals met: 0 of 11
4. (drop v5 l3 p5 c1 c2)
   deleted: (in p5 v5) (capacity v5 c1)
   added: (at p5 l3) (capacity v5 c2)
   goals met: 1 of 11
5. (drive v4 l8 l1)
   deleted: (at v4 l8)
   added: (at v4 l1)
   goals met: 1 of 11
6. (pick-up v3 l11 p6 c1 c2)
   deleted: (at p6 l11) (capacity v3 c2)
   added: (in p6 v3) (capacity v3 c1)
   goals met: 1 of 11
7. (drive v3 l11 l9)
   deleted: (at v3 l11)
   added: (at v3 l9)
   goals met: 1 of 11
8. (drop v3 l9 p6 c1 c2)
   deleted: (in p6 v3) (capacity v3 c1)
   added: (at p6 l9) (capacity v3 c2)
   goals met: 2 of 11
9. (drive v4 l1 l12)
   deleted: (at v4 l1)
   added: (at v4 l12)
   goals met: 2 of 11
10. (pick-up v3 l9 p10 c1 c2)
   deleted: (at p10 l9) (capacity v3 c2)
   added: (in p10 v3) (capacity v3 c1)
   goals met: 2 of 11
11. (drive v4 l12 l7)
   deleted: (at v4 l12)
   added: (at v4 l7)
   goals met: 2 of 11
12. (pick-up v4 l7 p7 c0 c1)
   deleted: (at p7 l7) (capacity v4 c1)
   added: (in p7 v4) (capacity v4 c0)
   goals met: 2 of 11
13. (drive v4 l7 l12)
   deleted: (at v4 l7)
   added: (at v4 l12)
   goals met: 2 of 11
14. (drop v4 l12 p7 c0 c1)
   deleted: (in p7 v4) (capacity v4 c0)
   added: (at p7 l12) (capacity v4 c1)
   goals met: 3 of 11
15. (drive v4 l12 l8)
   deleted: (at v4 l12)
   added: (at v4 l8)
   goals met: 3 of 11
16. (pick-up v4 l8 p1 c0 c1)
   deleted: (at p1 l8) (capacity v4 c1)
   added: (in p1 v4) (capacity v4 c0)
   goals met: 3 of 11
17. (drive v4 l8 l12)
   deleted: (at v4 l8)
   added: (at v4 l12)
   goals met: 3 of 11
18. (drop v4 l12 p1 c0 c1)
   deleted: (in p1 v4) (capacity v4 c0)
   added: (at p1 l12) (capacity v4 c1)
   goals met: 4 of 11
19. (drive v3 l9 l11)
   deleted: (at v3 l9)
   added: (at v3 l11)
   goals met: 4 of 11
20. (drop v3 l11 p10 c1 c2)
   deleted: (in p10 v3) (capacity v3 c1)
   added: (at p10 l11) (capacity v3 c2)
   goals met: 5 of 11
21. (drive v4 l12 l1)
   deleted: (at v4 l12)
   added: (at v4 l1)
   goals met: 5 of 11
22. (pick-up v2 l4 p8 c1 c2)
   deleted: (at p8 l4) (capacity v2 c2)
   added: (in p8 v2) (capacity v2 c1)
   goals met: 5 of 11
23. (drive v2 l4 l13)
   deleted: (at v2 l4)
   added: (at v2 l13)
   goals met: 5 of 11
24. (drive v4 l1 l9)
   deleted: (at v4 l1)
   added: (at v4 l9)
   goals met: 5 of 11
25. (pick-up v4 l9 p2 c0 c1)
   deleted: (at p2 l9) (capacity v4 c1)
   added: (in p2 v4) (capacity v4 c0)
   goals met: 5 of 11
26. (drive v4 l9 l1)
   deleted: (at v4 l9)
   added: (at v4 l1)
   goals met: 5 of 11
27. (drop v4 l1 p2 c0 c1)
   deleted: (in p2 v4) (capacity v4 c0)
   added: (at p2 l1) (capacity v4 c1)
   goals met: 6 of 11
28. (drive v2 l13 l3)
   deleted: (at v2 l13)
   added: (at v2 l3)
   goals met: 6 of 11
29. (drop v2 l3 p8 c1 c2)
   deleted: (in p8 v2) (capacity v2 c1)
   added: (at p8 l3) (capacity v2 c2)
   goals met: 7 of 11
30. (drive v4 l1 l13)
   deleted: (at v4 l1)
   added: (at v4 l13)
   goals met: 7 of 11
31. (drive v4 l13 l2)
   deleted: (at v4 l13)
   added: (at v4 l2)
   goals met: 7 of 11
32. (pick-up v4 l2 p9 c0 c1)
   deleted: (at p9 l2) (capacity v4 c1)
   added: (in p9 v4) (capacity v4 c0)
   goals met: 7 of 11
33. (drive v1 l5 l8)
   deleted: (at v1 l5)
   added: (at v1 l8)
   goals met: 7 of 11
34. (drive v4 l2 l13)
   deleted: (at v4 l2)
   added: (at v4 l13)
   goals met: 7 of 11
35. (drop v4 l13 p9 c0 c1)
   deleted: (in p9 v4) (capacity v4 c0)
   added: (at p9 l13) (capacity v4 c1)
   goals met: 8 of 11
36. (drive v4 l13 l9)
   deleted: (at v4 l13)
   added: (at v4 l9)
   goals met: 8 of 11
37. (pick-up v4 l9 p4 c0 c1)
   deleted: (at p4 l9) (capacity v4 c1)
   added: (in p4 v4) (capacity v4 c0)
   goals met: 8 of 11
38. (drive v4 l9 l2)
   deleted: (at v4 l9)
   added: (at v4 l2)
   goals met: 8 of 11
39. (drop v4 l2 p4 c0 c1)
   deleted: (in p4 v4) (capacity v4 c0)
   added: (at p4 l2) (capacity v4 c1)
   goals met: 9 of 11
40. (pick-up v1 l8 p11 c1 c2)
   deleted: (at p11 l8) (capacity v1 c2)
   added: (in p11 v1) (capacity v1 c1)
   goals met: 9 of 11
41. (pick-up v1 l8 p3 c0 c1)
   deleted: (at p3 l8) (capacity v1 c1)
   added: (in p3 v1) (capacity v1 c0)
   goals met: 9 of 11
42. (drive v1 l8 l2)
   deleted: (at v1 l8)
   added: (at v1 l2)
   goals met: 9 of 11
43. (drop v1 l2 p11 c0 c1)
   deleted: (in p11 v1) (capacity v1 c0)
   added: (at p11 l2) (capacity v1 c1)
   goals met: 10 of 11
44. (drive v1 l2 l5)
   deleted: (at v1 l2)
   added: (at v1 l5)
   goals met: 10 of 11
45. (drop v1 l5 p3 c1 c2)
   deleted: (in p3 v1) (capacity v1 c1)
   added: (at p3 l5) (capacity v1 c2)
   goals met: 11 of 11
